HA_1C/Catalogs/Проекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>Проекты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Детали</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДетальПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДеталиПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДеталиХаракт1</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДеталиХаракт2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДеталиХаракт3</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДеталиХаракт4</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДеталиХаракт5</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеталиХаракт1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеХарактеристики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеталиХаракт2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеХарактеристики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеталиХаракт3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеХарактеристики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеталиХаракт4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеХарактеристики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеталиХаракт5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеХарактеристики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Завершен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Формулы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДетальПроекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДеталиПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Формулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Формулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула3</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Формулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула4</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Формулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула5</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Формулы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФормулы1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФормулы2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФормулы3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФормулы4</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФормулы5</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдСтрокиДетали</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HA_1C/Catalogs/ДеталиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ДеталиПроекта</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеХарактеристики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

HA_1C/Catalogs/Проекты/Forms/ФормаКонвертацииЕдИзм/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("ФизХарактеристики") Тогда
		Возврат;
	КонецЕсли;
	
	ФизХарактеристики = Параметры.ФизХарактеристики;
	
	ОбновитьЭлементыДеталиПроекта(ФизХарактеристики);
	ОбновитьЭлементыХарактеристик(ФизХарактеристики);
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандРеквизитовФормы

&НаКлиенте
Процедура Подключаемый_ХарактеристикаОбработкаВыбора(Элемент, ВыбранноеЗначение) 
	
	НомерХарактеристики = Элемент.Родитель.Родитель.ПодчиненныеЭлементы.Индекс(Элемент.Родитель) + 1;
	
	ИмяРеквизита = ФормыПроектыКлиентСервер.ИмяКолонкиЗначенияХарактеристики()+ НомерХарактеристики;
	
	КонвертированноеЧило = ПересчитатьЕдиницуИзмеренияНаСервере(
		ЭтотОбъект[Элемент.Имя], 
		ВыбранноеЗначение, 
		ЭтотОбъект[ИмяРеквизита]
	);
	
	ЭтотОбъект[ИмяРеквизита] = КонвертированноеЧило;
	
	УстановитьТипХарактеристикиПоСсылке(ИмяРеквизита, ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НажатиеЭлемента(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьВыборХарактеристики(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьХарактеристику(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИндексЭлемента = ИндексЭлементаПоИмени(Элемент.Имя);
	ИмяГруппы = ФормыПроектыКлиентСервер.ИмяГруппыДеталиХарактеристики() + Строка(ИндексЭлемента);
	Элементы[ИмяГруппы].Видимость = Ложь;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОткрытьВыборХарактеристики(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДеталиПроекта(Элемент)
	
	ДетальПроектаПриИзменииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	
	ОбработатьЗакрытиеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьХарактеристику(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьДобавлениеХарактеристики", ЭтотОбъект);
	ОткрытьФорму("Справочник.ФизическиеХарактеристики.ФормаВыбора",,,,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьДобавлениеХарактеристики(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипХарактеристики = ТипХарактеристикиПоСсылке(ВыбранноеЗначение);
	
	СтрокаХарактеристики = Новый Структура("Характеристика,ТипХарактеристики,Значение", 
		ВыбранноеЗначение, 
		ТипХарактеристики, 
		0
	);
	
	ИндексСвободнойХарактеристики = СвободныйИндексХарактеристики();
	
	ДобавитьХарактеристикуНаФорму(СтрокаХарактеристики, ИндексСвободнойХарактеристики);
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьХарактеристику(Команда)
	
	ИмяГруппы = ФормыПроектыКлиентСервер.ИмяГруппыДеталиХарактеристики() + АктивныеХарактеристикиФормы(ЭтотОбъект).Количество();
	Элементы[ИмяГруппы].Видимость = Ложь;
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЭлементыДеталиПроекта(ФизХарактеристики)
	
	// Добавляем реквизиты для детали проекта
	ЭлементРеквизита = ФормыОбщиеДействияСервер.ДобавитьРеквизитСоСвязаннымЭлементомНаФорму(
		ЭтотОбъект, ИмяРеквизитаДетальПроекта(), ФизХарактеристики.ДетальПроекта,
		Элементы.ГруппаДеталь
	);
	ЭлементРеквизита.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементРеквизита.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементРеквизита.РедактированиеТекста = Ложь;
	ЭлементРеквизита.Шрифт = ШрифтыСтиля.КрупныйШрифтТекста;
	ЭлементРеквизита.УстановитьДействие("ПриИзменении", "Подключаемый_ПриИзмененииДеталиПроекта");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыХарактеристик(ДетальСФизХарактеристиками)
	
	ФизХарактеристики = ДетальСФизХарактеристиками.Характеристики;
	Счетчик = 1;
	Для каждого СтрокаХарактеристики Из ФизХарактеристики Цикл
		
		ДобавитьХарактеристикуНаФорму(СтрокаХарактеристики, Счетчик);
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
	// Скрыть лишние элементы характеристик
	Для Счетчик = ФизХарактеристики.Количество() + 1 По ФормыПроектыКлиентСервер.ЛимитХарактеристик() Цикл
		
		ЭлементСтроки = Элементы.Найти(ФормыПроектыКлиентСервер.ИмяГруппыДеталиХарактеристики() + Счетчик);
		Если ЭлементСтроки <> Неопределено Тогда
			ЭлементСтроки.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИмяРеквизитаДетальПроекта()
	Возврат "ДетальПроекта";
КонецФункции

&НаКлиенте
Функция ОбработатьЗакрытиеФормы()
	
	АдресТЗ = РезультатЗакрытияФормы();
	ОповеститьОВыборе(АдресТЗ);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПересчитатьЕдиницуИзмеренияНаСервере(ИсхФизХар, КонФизХар, Количество)
	
	Возврат Справочники.КлассификаторЕдиницИзмерения.ПересчитатьЕдиницуИзмерения(
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсхФизХар, "ЕдиницаИзмерения"), 
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КонФизХар, "ЕдиницаИзмерения"), 
		Количество);
		
КонецФункции

&НаСервереБезКонтекста
Функция РодительХаракт(знач ХарактеристикаСсылка)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ХарактеристикаСсылка, "Родитель");

	
КонецФункции

&НаКлиенте
Процедура КолВоХарактеристикНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВыборХарактеристики(Элемент)
	
	НомерХарактеристики = Элемент.Родитель.Родитель.ПодчиненныеЭлементы.Индекс(Элемент.Родитель) + 1;
	ЭлементХарактеристики = Элементы[ФормыПроектыКлиентСервер.ИмяКолонкиХарактеристики() + НомерХарактеристики];
	
	РодительХаракт = РодительХаракт(ЭтотОбъект[ФормыПроектыКлиентСервер.ИмяКолонкиХарактеристики() + НомерХарактеристики]);
	
	ПараметрыФормы = Новый Структура("ТекущийРодитель, Отбор", РодительХаракт);
	
	СтруктураОтбора = Новый Структура();
	СтруктураОтбора.Вставить("Родитель", РодительХаракт);
	ПараметрыФормы.Отбор = СтруктураОтбора;
	
	ОткрытьФорму("Справочник.ФизическиеХарактеристики.ФормаВыбора", ПараметрыФормы, ЭлементХарактеристики);
	
КонецПроцедуры

&НаСервере
Процедура ДетальПроектаПриИзменииСервер()
	
	ДетальПроекта = ЭтотОбъект[ИмяРеквизитаДетальПроекта()];
	
	ДетальСХарактеристиками = Новый Структура;
	ДетальСХарактеристиками.Вставить("ДетальПроекта", ДетальПроекта);
	
	ХарактеристикиДетали = Справочники.ДеталиПроекта.ЗапроситьПараметрыДетали(
		ОбщегоНазначения.ЗначениеВМассив(ДетальПроекта));
		
	ДетальСХарактеристиками.Вставить("Характеристики", ХарактеристикиДетали);
	
	ОбновитьЭлементыХарактеристик(ДетальСХарактеристиками);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьХарактеристикуНаФорму(СтрокаХарактеристики, Счетчик)

	РодительСтроки = ФормыОбщиеДействияСервер.НайтиДобавитьГруппуФормы(
		ЭтотОбъект, ФормыПроектыКлиентСервер.ИмяГруппыДеталиХарактеристики() + Счетчик, Элементы.ГруппаРеквизиты);
	РодительСтроки.Видимость = Истина;
	
	// Добавляем Картинку для Стрелки
	ЭлементРеквизита = ФормыОбщиеДействияСервер.НайтиДобавитьЭлементФормы(
		ЭтотОбъект, 
		ИмяДекорацииУдаления() + Счетчик, 
		Тип("ДекорацияФормы"), 
		РодительСтроки
	);
	ЭлементРеквизита.Вид = ВидДекорацииФормы.Картинка;
	ЭлементРеквизита.Картинка = БиблиотекаКартинок.Закрыть;
	ЭлементРеквизита.Гиперссылка = Истина;
	ЭлементРеквизита.УстановитьДействие("Нажатие", "Подключаемый_УдалитьХарактеристику");
	
	// Добавляем Реквизиты для Ссылки на новую ФизическуюХарактеристику
	ЭлементРеквизита = ФормыОбщиеДействияСервер.ДобавитьРеквизитСоСвязаннымЭлементомНаФорму(
		ЭтотОбъект, ФормыПроектыКлиентСервер.ИмяКолонкиХарактеристики() + Счетчик, СтрокаХарактеристики.Характеристика,
		РодительСтроки
	);
	ЭлементРеквизита.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементРеквизита.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементРеквизита.РедактированиеТекста = Ложь;
	ЭлементРеквизита.УстановитьДействие("ОбработкаВыбора", "Подключаемый_ХарактеристикаОбработкаВыбора");
	
	// Добавление элемента для физической единицы
	ЭлементРеквизита = ФормыОбщиеДействияСервер.ДобавитьРеквизитСоСвязаннымЭлементомНаФорму(
		ЭтотОбъект, ФормыПроектыКлиентСервер.ИмяКолонкиЗначенияХарактеристики() + Счетчик, 
		СтрокаХарактеристики.Значение,
		РодительСтроки, 
		ФормыОбщиеДействияСервер.ВсеТипыФизическихХарактеристик()
	);
	ЭлементРеквизита.Вид = ВидПоляФормы.ПолеВвода;
	ЭлементРеквизита.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	ЭлементРеквизита.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	
	ФормыОбщиеДействияСервер.ПривестиРеквизитКТипуХарактеристики(
		ЭтотОбъект[ФормыПроектыКлиентСервер.ИмяКолонкиЗначенияХарактеристики() + Счетчик], 
		СтрокаХарактеристики.ТипХарактеристики);
		
	ЭлементРеквизита.ОграничениеТипа =
		 ФормыОбщиеДействияСервер.ОписаниеТипаХарактеристикиПоЗначению(
		 ЭтотОбъект[ФормыПроектыКлиентСервер.ИмяКолонкиЗначенияХарактеристики() + Счетчик]);

КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	КолВоХарактеристик = АктивныеХарактеристикиФормы(ЭтотОбъект).Количество();
	
	Элементы.ДобавитьХарактеристику.Доступность = (КолВоХарактеристик < ФормыПроектыКлиентСервер.ЛимитХарактеристик());
	Элементы.УдалитьХарактеристику.Доступность = (КолВоХарактеристик > 1);
	
	Для каждого ЭлементФормы Из Элементы Цикл
		Если СтрНачинаетсяС(ЭлементФормы.Имя, ИмяДекорацииУдаления()) Тогда
			Если СтрЗаканчиваетсяНа(ЭлементФормы.Имя, "РасширеннаяПодсказка") Тогда
				// У расширенной подсказки нет свойства Видимость и своего типа
				Продолжить;
			КонецЕсли;
			ЭлементФормы.Доступность = (КолВоХарактеристик > 1);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция УстановитьТипХарактеристикиПоСсылке(ИмяРеквизита, ХарактеристикаСсылка)
	
	ТипХарактеристики = Справочники.ФизическиеХарактеристики.ТипХарактеристикиПоСсылке(ХарактеристикаСсылка);
	Элементы[ИмяРеквизита].ОграничениеТипа = ФормыОбщиеДействияСервер.ОписаниеТипаХарактеристики(ТипХарактеристики);
	
КонецФункции

&НаСервере
Функция РезультатЗакрытияФормы();
	
	ДеталиСХарактеристиками = Новый Структура;
	ДеталиСХарактеристиками.Вставить("ДетальПроекта", ЭтотОбъект[ИмяРеквизитаДетальПроекта()]);
	
	ТЗХарактеристики = Новый ТаблицаЗначений;
	ТЗХарактеристики.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ФизическиеХарактеристики"));
	ТЗХарактеристики.Колонки.Добавить("ДетальПроекта", Новый ОписаниеТипов("СправочникСсылка.ДеталиПроекта"));
	ТЗХарактеристики.Колонки.Добавить("Значение", ФормыОбщиеДействияСервер.ВсеТипыФизическихХарактеристик());
	Для каждого ХаркаФормы Из АктивныеХарактеристикиФормы(ЭтотОбъект) Цикл
		СтрокаХарактеристик = ТЗХарактеристики.Добавить();
		СтрокаХарактеристик.Характеристика = ЭтотОбъект[ФормыПроектыКлиентСервер.ИмяКолонкиХарактеристики() + ИндексЭлементаПоИмени(ХаркаФормы.Имя)];
		СтрокаХарактеристик.Значение = ЭтотОбъект[ФормыПроектыКлиентСервер.ИмяКолонкиЗначенияХарактеристики() + ИндексЭлементаПоИмени(ХаркаФормы.Имя)];
	КонецЦикла;
	ДеталиСХарактеристиками.Вставить("Характеристики", ТЗХарактеристики);
	
	Возврат ПоместитьВоВременноеХранилище(ДеталиСХарактеристиками);
	
КонецФункции

&НаСервереБезКонтекста
Функция ТипХарактеристикиПоСсылке(Характеристика) Экспорт

	Возврат Справочники.ФизическиеХарактеристики.ТипХарактеристикиПоСсылке(Характеристика)

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИндексЭлементаПоИмени(ИмяЭлемента)
	
	Возврат Прав(ИмяЭлемента, 1);
	
КонецФункции

&НаКлиенте
Функция СвободныйИндексХарактеристики()
	
	ИндексХарактеристики = 0;
	Для каждого ЭлементФормы Из Элементы Цикл
		Если СтрНачинаетсяС(ЭлементФормы.Имя, ФормыПроектыКлиентСервер.ИмяГруппыДеталиХарактеристики()) Тогда
			Если СтрЗаканчиваетсяНа(ЭлементФормы.Имя, "РасширеннаяПодсказка") Тогда
				// У расширенной подсказки нет свойства Видимость и своего типа
				Продолжить;
			КонецЕсли;
			Если ЭлементФормы.Видимость Тогда
				ИндексХарактеристики = Макс(ИндексХарактеристики, Число(ИндексЭлементаПоИмени(ЭлементФормы.Имя)));
			Иначе
				Возврат Число(ИндексЭлементаПоИмени(ЭлементФормы.Имя));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИндексХарактеристики + 1;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция АктивныеХарактеристикиФормы(Форма)
	
	Элементы = Форма.Элементы;
	
	АктивныеХарактеристики = Новый Массив;
	Для каждого ЭлементФормы Из Элементы Цикл
		Если СтрНачинаетсяС(ЭлементФормы.Имя, ФормыПроектыКлиентСервер.ИмяГруппыДеталиХарактеристики()) Тогда
			Если СтрЗаканчиваетсяНа(ЭлементФормы.Имя, "РасширеннаяПодсказка") Тогда
				// У расширенной подсказки нет свойства Видимость и своего типа
				Продолжить;
			КонецЕсли;
			Если ЭлементФормы.Видимость Тогда
				АктивныеХарактеристики.Добавить(ЭлементФормы);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат АктивныеХарактеристики;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИмяДекорацииУдаления()
	
	Возврат "ДекорацияСтрелка";
	
КонецФункции

#КонецОбласти
